# Задача 2: Найдите сумму цифр трехзначного числа.
# Примеры:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input("Введите целое число: "))
number = n
s = 0
while(n != 0):
    m = n % 10
    s += m
    n //= 10

print("Сумма числ числа: ", number, "= ", s)
